simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
/*
 * ESP Esclavo — Geofono node
 *
 * Lee muestras del PSoC via UART (raw) y las envía al maestro via ESP-NOW.
 *
 * Configurar hardware en platformio.ini:
 *   NODE_ID, pines UART al PSoC, pines SYNC, marcadores de osciloscopio
 *   y MAC del maestro.
 *
 * Estados:
 *   WAIT_ARM  → espera CMD_ARM del maestro
 *   ARMED     → envia CMD_ARM_ACK, espera PRESTART
 *   HOT_WAIT  → PRESTART recibido; no hace nada salvo esperar START/consulta
 *   SAMPLING  → lee PSoC y envía batches
 *   STOPPED   → vuelve a WAIT_ARM al recibir CMD_STOP
 */

#include <Arduino.h>
#include <esp_wifi.h>
#include "psoc_uart.h"
#include "espnow_transport.h"
#include "sync_protocol.h"
#include "debug_log.h"
#include "../../scope_measurement.h"

/* ── Configuración ────────────────────────────────────────────────────────── */
#ifndef NODE_ID
  #define NODE_ID 1
#endif
#ifndef SAMPLE_PULSE_PIN
  #define SAMPLE_PULSE_PIN -1   /* Deshabilitado: no conmutar GPIO/LED durante muestreo. */
#endif
#ifndef SAMPLE_PULSE_IDLE
  #if defined(ESP8266)
    #define SAMPLE_PULSE_IDLE HIGH
  #else
    #define SAMPLE_PULSE_IDLE LOW
  #endif
#endif
#ifndef SAMPLE_PULSE_US
  #define SAMPLE_PULSE_US 2
#endif
#ifndef DEBUG_HARDWARE
  #define DEBUG_HARDWARE 0
#endif
#ifndef DEBUG_HW_START_PIN
  #define DEBUG_HW_START_PIN -1
#endif
#ifndef DEBUG_HW_START_IDLE
  #define DEBUG_HW_START_IDLE LOW
#endif
#ifndef DEBUG_HW_START_US
  #define DEBUG_HW_START_US SCOPE_START_PULSE_US
#endif
/* Logging (humano + máquina) en debug_log.h, gateado por DBG_ENABLE. */

/* MAC del ESP maestro. El valor real debe venir de platformio.ini. */
#ifndef MASTER_MAC0
  #define MASTER_MAC0 0xFF
#endif
#ifndef MASTER_MAC1
  #define MASTER_MAC1 0xFF
#endif
#ifndef MASTER_MAC2
  #define MASTER_MAC2 0xFF
#endif
#ifndef MASTER_MAC3
  #define MASTER_MAC3 0xFF
#endif
#ifndef MASTER_MAC4
  #define MASTER_MAC4 0xFF
#endif
#ifndef MASTER_MAC5
  #define MASTER_MAC5 0xFF
#endif
static const uint8_t MASTER_MAC[6] = {
    MASTER_MAC0, MASTER_MAC1, MASTER_MAC2,
    MASTER_MAC3, MASTER_MAC4, MASTER_MAC5
};

/* Pines GPIO hardware sync. platformio.ini es la fuente de verdad; estos
 * defaults solo evitan romper builds viejos que no definan las macros. */
#ifndef SYNC_IN_PIN
  #if defined(ESP8266)
    #define SYNC_IN_PIN 5
  #else
    #define SYNC_IN_PIN 26
  #endif
#endif
#ifndef SYNC_TO_PSOC_PIN
  #if defined(ESP8266)
    #define SYNC_TO_PSOC_PIN 16
  #else
    #define SYNC_TO_PSOC_PIN 27
  #endif
#endif

/* ── Estado ──────────────────────────────────────────────────────────────── */
enum SlaveState { WAIT_ARM, ARMED, HOT_WAIT, SAMPLING, STOPPED };
static volatile SlaveState g_state       = WAIT_ARM;
static bool                g_psocConnected = false;  /* resultado de probe() en setup */
static volatile uint64_t   g_t_start_us  = 0;
static volatile bool       g_debug_mode  = false;
static          uint32_t   g_debug_count = 0;
static volatile uint32_t   g_debug_last_us = 0;
/* g_debugHwActive / g_debugHwFallUs viven en scope_pulse.h */
static          uint8_t    g_pga_code    = 0;
static          uint8_t    g_pgavdac     = 0;
static          uint8_t    g_vdac_byte   = 128;
static          bool       g_cfg_waiting = false;
static          uint8_t    g_cfg_sub_cmd = 0;
static          uint8_t    g_cfg_param   = 0;
static          uint32_t   g_cfg_due_ms  = 0;

/* ── Store-and-forward ───────────────────────────────────────────────────── */
static uint16_t    g_rec_n_batches = 0;          /* 0 = modo streaming clásico */
static SampleBytes *g_store_buf    = nullptr;    /* n_batches × 30 SampleBytes */
static uint32_t   *g_store_ts_us   = nullptr;    /* timestamp relativo por batch */
static uint16_t    g_store_fill    = 0;

/* ── Modo "Ver" (disparo único, store primero y dump después) ────────────── */
static volatile uint16_t g_view_remaining   = 0; /* legado live deshabilitado */
static volatile bool     g_view_armPending  = false;
static volatile uint32_t g_view_armDueUs    = 0; /* cuándo levantar el flanco */
static volatile bool     g_view_store_active = false;

#define PSOC_CFG_ACK_TIMEOUT_MS 250u

/* ── Objetos ─────────────────────────────────────────────────────────────── */
static PsocUART       psoc;
static EspNowTransport transport;

/* Helpers de pulsos GPIO de osciloscopio (módulo aparte). */
#include "scope_pulse.h"

static void pulseSampleCount(uint8_t n)
{
    for (uint8_t i = 0; i < n; i++) {
        samplePulse();
    }
}

static void logPsocUartDiag(const char *tag)
{
    const unsigned long bytes = (unsigned long)psoc.bytesRx();
    const unsigned long mark  = (unsigned long)psoc.markersRx();
    const unsigned long drop  = (unsigned long)psoc.syncDrops();
    const unsigned long badLn = (unsigned long)psoc.badLen();
    const unsigned long ping  = (unsigned long)psoc.pingsRx();
    const int rxLevel = digitalRead(PSOC_UART_RX);

    if (psoc.hasLastByte()) {
        SLAVE_LOG_PRINTF(
            "[SLAVE %d] %s bOK=%lu bBad=%lu uartBytes=%lu mark=%lu drop=%lu badLen=%lu ping=%lu rx=%d last=0x%02X age=%lu txOK=%lu txFail=%lu state=%d view=%u\n",
            NODE_ID, tag,
            (unsigned long)psoc.batchesOK(), (unsigned long)psoc.batchesBad(),
            bytes, mark, drop, badLn, ping, rxLevel,
            psoc.lastByte(), (unsigned long)psoc.lastByteAgeMs(),
            (unsigned long)transport.sentOK(), (unsigned long)transport.sentFail(),
            (int)g_state, (unsigned)g_view_remaining);
    } else {
        SLAVE_LOG_PRINTF(
            "[SLAVE %d] %s bOK=%lu bBad=%lu uartBytes=%lu mark=%lu drop=%lu badLen=%lu ping=%lu rx=%d last=none txOK=%lu txFail=%lu state=%d view=%u\n",
            NODE_ID, tag,
            (unsigned long)psoc.batchesOK(), (unsigned long)psoc.batchesBad(),
            bytes, mark, drop, badLn, ping, rxLevel,
            (unsigned long)transport.sentOK(), (unsigned long)transport.sentFail(),
            (int)g_state, (unsigned)g_view_remaining);
    }
}

/* ── ISR GPIO hardware sync (IRAM para máxima velocidad) ────────────────── */
void IRAM_ATTR onSyncEdge()
{
    int level = digitalRead(SYNC_IN_PIN);
    if (level == HIGH && g_state == HOT_WAIT) {
        digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
        uint32_t nowUs = (uint32_t)micros();
        g_t_start_us    = (uint64_t)nowUs;
        g_store_fill    = 0;
        g_debug_count   = 0;
        g_debug_last_us = nowUs;
        g_state = SAMPLING;
    } else if (level == LOW && g_state == SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_state = STOPPED;
    } else if (g_state != SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    }
}

