simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
/* ── Forward declarations ────────────────────────────────────────────────── */
static void allocStore(uint16_t n_batches);
static void handleReqBatch(const MsgReqBatch *msg);

/* ── Callbacks ESP-NOW ───────────────────────────────────────────────────── */

static void sendCfgAck(uint8_t sub_cmd, uint8_t ok)
{
    MsgCfgAck ack = { CMD_CFG_ACK, NODE_ID, sub_cmd, ok };
    espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
}

static bool isGainCode(uint8_t code)
{
    return code <= 8u;
}

static void applyConfirmedConfig(uint8_t sub_cmd, uint8_t value)
{
    switch (sub_cmd) {
        case 0xA6:
            g_pga_code = value;
            break;
        case 0xA9:
            g_pgavdac = value;
            break;
        case 0xAA:
            g_vdac_byte = value;
            break;
        default:
            break;
    }
}

static void waitForPsocConfigAck(uint8_t sub_cmd, uint8_t param)
{
    g_cfg_waiting = true;
    g_cfg_sub_cmd = sub_cmd;
    g_cfg_param = param;
    g_cfg_due_ms = millis() + PSOC_CFG_ACK_TIMEOUT_MS;
}

static void servicePsocConfigAck()
{
    if (g_state == SAMPLING || g_view_armPending) {
        return;   /* Nunca emitir ACK/timeout por radio durante la captura. */
    }

    uint8_t ackCmd = 0;
    uint8_t ackVal = 0;
    while (psoc.takeConfigAck(ackCmd, ackVal)) {
        g_psocConnected = true;
        if (g_cfg_waiting && ackCmd == g_cfg_sub_cmd) {
            const uint8_t ok = (ackVal == g_cfg_param) ? 1u : 0u;
            if (ok) {
                applyConfirmedConfig(ackCmd, ackVal);
            }
            sendCfgAck(g_cfg_sub_cmd, ok);
            SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack sub=0x%02X val=%u expected=%u ok=%u\n",
                             ackCmd, ackVal, g_cfg_param, ok);
            LOGM("CFG_ACK", "sub=0x%02X,val=%u,expected=%u,ok=%u",
                 ackCmd, ackVal, g_cfg_param, ok);
            g_cfg_waiting = false;
        } else {
            applyConfirmedConfig(ackCmd, ackVal);
            SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack unsolicited sub=0x%02X val=%u\n",
                             ackCmd, ackVal);
            LOGM("CFG_ACK_UNSOL", "sub=0x%02X,val=%u", ackCmd, ackVal);
        }
    }

    if (g_cfg_waiting && (int32_t)(millis() - g_cfg_due_ms) >= 0) {
        sendCfgAck(g_cfg_sub_cmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack timeout sub=0x%02X expected=%u\n",
                         g_cfg_sub_cmd, g_cfg_param);
        LOGM("CFG_TIMEOUT", "sub=0x%02X,expected=%u", g_cfg_sub_cmd, g_cfg_param);
        g_cfg_waiting = false;
    }
}

static void sendStartAck(uint8_t status, uint32_t startToken, uint32_t rxUs)
{
    MsgStartAck ack = { CMD_START_ACK, NODE_ID, status, startToken, rxUs };
    espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
}

static bool storeReadyForHotWait()
{
    return (g_rec_n_batches == 0) || (g_store_buf != nullptr && g_store_ts_us != nullptr);
}

static void enterHotWait(uint16_t n_batches)
{
    allocStore(n_batches);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    g_t_start_us     = 0;
    g_store_fill     = 0;
    g_view_remaining = 0;
    g_view_store_active = false;
    g_debug_count    = 0;
    g_debug_last_us  = (uint32_t)micros();
    g_state = HOT_WAIT;
    /* Armar el PSoC por UART: set N y pre-start (queda esperando flanco SYNC). */
    psoc.setN(n_batches);
    psoc.preStart();
    SLAVE_LOG_PRINTF("[SLAVE] HOT_WAIT n=%u ready=%u\n",
                     n_batches, (unsigned)storeReadyForHotWait());
    LOGM("HOTWAIT", "n=%u,ready=%u", n_batches, (unsigned)storeReadyForHotWait());
}

static void sendHotWaitAck()
{
    uint8_t ok = (g_state == HOT_WAIT && storeReadyForHotWait()) ? 1 : 0;
    MsgHotWaitAck ack = {
        CMD_HOTWAIT_ACK, NODE_ID, ok, (uint8_t)g_state, g_rec_n_batches
    };
    espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
    SLAVE_LOG_PRINTF("[SLAVE] HOTWAIT_ACK ok=%u state=%u n=%u\n",
                     ok, (unsigned)g_state, g_rec_n_batches);
}

static void debugEspSetRamp(bool enable)
{
    g_debug_mode = enable;
    g_debug_count = 0;
    g_debug_last_us = (uint32_t)micros();
    if (enable) {
        g_store_fill  = 0;   /* reset store index para que cada test/debug empiece desde 0 */
        if (g_rec_n_batches == 0 && g_state != HOT_WAIT) {
            /* Modo streaming/test: A7 arranca la rampa inmediatamente. */
            g_t_start_us = (uint64_t)g_debug_last_us;
            g_state = SAMPLING;
        } else if (g_state == WAIT_ARM || g_state == STOPPED) {
            /* Store-and-forward: A7 solo selecciona debug; START/SYNC arranca. */
            g_state = ARMED;
        }
    } else if (g_state == SAMPLING) {
        g_state = STOPPED;
    } else if (g_rec_n_batches == 0 && g_state != HOT_WAIT) {
        g_state = WAIT_ARM;
    }
}

static void handleSetConfig(const MsgSetConfig *cfg)
{
    if (cfg->node_id != NODE_ID) return;
    if (g_state == SAMPLING || g_view_armPending) {
        SLAVE_LOG_PRINTF("[SLAVE] cfg ignored during capture sub=0x%02X\n",
                         cfg->sub_cmd);
        LOGM("CFG_IGN_CAPTURE", "sub=0x%02X", cfg->sub_cmd);
        return;   /* Sin ACK por radio mientras se muestrea. */
    }
    servicePsocConfigAck();
    if (g_cfg_waiting) {
        sendCfgAck(cfg->sub_cmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] cfg busy sub=0x%02X pending=0x%02X\n",
                         cfg->sub_cmd, g_cfg_sub_cmd);
        LOGM("CFG_BUSY", "sub=0x%02X,pending=0x%02X", cfg->sub_cmd, g_cfg_sub_cmd);
        return;
    }

    uint8_t ok = 1;
    bool waitAck = false;
    switch (cfg->sub_cmd) {
        case 0xA6:                       /* PGA */
            if (!isGainCode(cfg->param)) {
                ok = 0;
            } else {
                psoc.setPga(cfg->param);
                waitAck = true;
            }
            break;
        case 0xA9:                       /* PGAvdac */
            if (!isGainCode(cfg->param)) {
                ok = 0;
            } else {
                psoc.setPgavdac(cfg->param);
                waitAck = true;
            }
            break;
        case 0xAA:                       /* VDAC (calibración) */
            psoc.setVdac(cfg->param);
            waitAck = true;
            break;
        default:
            ok = 0;
            break;
    }
    if (ok && waitAck) {
        waitForPsocConfigAck(cfg->sub_cmd, cfg->param);
    } else {
        sendCfgAck(cfg->sub_cmd, ok);
    }
    SLAVE_LOG_PRINTF("[SLAVE] cfg sub=0x%02X p=%u ok=%u\n",
                     cfg->sub_cmd, cfg->param, ok);
    LOGM("CFG", "sub=0x%02X,p=%u,ok=%u,wait=%u",
         cfg->sub_cmd, cfg->param, ok, (unsigned)waitAck);
}

