simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static void handleDebugNode(const MsgDebugNode *dbg)
{
    if (dbg->node_id != NODE_ID) return;
    bool enable = (dbg->enable != 0);
    debugEspSetRamp(enable);
    sendCfgAck(0xA7, 1);
    SLAVE_LOG_PRINTF("[SLAVE] debug_node=%d\n", (int)g_debug_mode);
}

#if defined(ESP8266)
static void onDataRecv(uint8_t *mac, uint8_t *data, uint8_t len)
#else
static void onDataRecv(const uint8_t *mac, const uint8_t *data, int len)
#endif
{
    (void)mac;
    if (len < 1) return;
    uint8_t cmd = data[0];
    if (g_state == SAMPLING && cmd != CMD_STOP) {
        return;   /* Nada de ACK/log/radio mientras el ADC está muestreando. */
    }
    LOGM("RX", "cmd=0x%02X,len=%d,state=%d", cmd, len, (int)g_state);

    if (cmd == CMD_ARM &&
        (g_state == WAIT_ARM || g_state == ARMED || g_state == HOT_WAIT ||
         g_state == STOPPED || g_state == SAMPLING)) {
        g_debug_mode = false;   /* detener debug stream si estaba activo */
        g_state = ARMED;
        MsgArmAck ack = { CMD_ARM_ACK, NODE_ID, 0 };
        espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
        SLAVE_LOG_PRINTLN("[SLAVE] ARMED");
    }
    else if (cmd == CMD_PRESTART && len >= (int)sizeof(MsgPrestart) &&
             g_state != SAMPLING) {
        const MsgPrestart *msg = (const MsgPrestart *)data;
        enterHotWait(msg->n_batches);
    }
    else if (cmd == CMD_HOTWAIT_QUERY && len >= (int)sizeof(MsgHotWaitQuery)) {
        const MsgHotWaitQuery *msg = (const MsgHotWaitQuery *)data;
        if (msg->node_id == NODE_ID) {
            sendHotWaitAck();
        }
    }
    else if (cmd == CMD_SCOPE_START && len >= (int)sizeof(MsgScopeStart)) {
        if (g_state == HOT_WAIT && storeReadyForHotWait()) {
            debugEspHardwareStartPulse();
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);
            SLAVE_LOG_PRINTLN("[SLAVE] SCOPE_START");
        } else {
            SLAVE_LOG_PRINTF("[SLAVE] SCOPE_START ignored state=%d ready=%u\n",
                             (int)g_state, (unsigned)storeReadyForHotWait());
        }
    }
    else if (cmd == CMD_START && len >= (int)sizeof(MsgStart)) {
        const MsgStart *msg = (const MsgStart *)data;
        uint8_t targetNode = msg->target_node & 0x7Fu;
        bool probeOnly = (msg->target_node & 0x80u) != 0;
        if (targetNode != 0 && targetNode != NODE_ID) return;

        uint32_t nowUs = (uint32_t)micros();
        uint32_t startToken = (uint32_t)msg->t_start_us;
        if (probeOnly) {
            sendStartAck((g_state == HOT_WAIT && storeReadyForHotWait()) ? 2 : 0,
                         startToken, nowUs);
            SLAVE_LOG_PRINTF("[SLAVE] START probe token=%u state=%d\n",
                             (unsigned)startToken, (int)g_state);
            return;
        }
        if (g_state == SAMPLING) {
            sendStartAck(1, startToken, nowUs);
            SLAVE_LOG_PRINTF("[SLAVE] START already sampling token=%u\n",
                             (unsigned)startToken);
            return;
        }
        bool startAllowed = (g_state == HOT_WAIT && storeReadyForHotWait());
        if (!startAllowed) {
            sendStartAck(0, startToken, nowUs);
            SLAVE_LOG_PRINTF("[SLAVE] START ignored state=%d ready=%u\n",
                             (int)g_state, (unsigned)storeReadyForHotWait());
            return;
        }
        sendStartAck(1, startToken, nowUs);
        digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
        /* START por software: usar como fallback si no hay cable GPIO */
        g_t_start_us    = msg->t_start_us;
        g_store_fill    = 0;   /* reset store index para nueva grabación */
        g_debug_count   = 0;
        g_debug_last_us = nowUs;
        g_state = SAMPLING;
    }
    else if (cmd == CMD_STOP) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_debug_mode = false;
        if (g_view_remaining > 0) {
            g_view_remaining = 0;
        }
        psoc.debugRamp(false);      /* por seguridad: cortar cualquier debug PSoC */
        g_view_armPending = false;
        g_view_store_active = false;
        g_state = STOPPED;
        SLAVE_LOG_PRINTLN("[SLAVE] STOP");
    }
    else if (cmd == CMD_DEBUG && len >= (int)sizeof(MsgDebug)) {
        const MsgDebug *d = (const MsgDebug *)data;
        bool enable = (d->enable != 0);
        debugEspSetRamp(enable);
        MsgArmAck ack = { CMD_ARM_ACK, NODE_ID, (uint8_t)(g_debug_mode ? 0xDD : 0x00) };
        espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
        SLAVE_LOG_PRINTF("[SLAVE] debug=%d\n", (int)g_debug_mode);
    }
    else if (cmd == CMD_SET_CONFIG && len >= (int)sizeof(MsgSetConfig)) {
        handleSetConfig((const MsgSetConfig *)data);
    }
    else if (cmd == CMD_DEBUG_NODE && len >= (int)sizeof(MsgDebugNode)) {
        handleDebugNode((const MsgDebugNode *)data);
    }
    else if (cmd == CMD_VIEW && len >= (int)sizeof(MsgView)) {
        /* "Ver": disparo único — guarda en RAM primero (sin TX ESP-NOW durante el
         * muestreo), luego el maestro hace dump vía REQ_BATCH. Así se elimina la
         * interferencia de RF que ensuciaba la señal en el modo live anterior. */
        const MsgView *msg = (const MsgView *)data;
        if (msg->node_id != NODE_ID) return;
        uint16_t n = msg->n ? msg->n : 1;
        if (!g_psocConnected) {
            SLAVE_LOG_PRINTF("[SLAVE] VIEW: PSoC aun sin HELLO, intento igual\n");
            LOGM("VIEW_WARN", "psoc=0");
        }
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_debug_mode = false;
        psoc.debugRamp(false);
        enterHotWait(n);               /* store-then-dump: no hay TX durante muestreo */
        uint8_t ok = storeReadyForHotWait() ? 1u : 0u;
        if (ok) {
            g_view_store_active = true;
            g_view_armPending = true;
            g_view_armDueUs   = (uint32_t)micros() + 3000u;
        } else {
            g_view_armPending = false;
            g_view_store_active = false;
            g_state = STOPPED;
        }
        sendCfgAck(CMD_VIEW, ok);
        SLAVE_LOG_PRINTF("[SLAVE] VIEW n=%u (store sync ok=%u)\n", n, ok);
        LOGM("VIEW", "n=%u,store=1,sync=1,ok=%u", n, ok);
    }
    else if (cmd == CMD_DEBUG_PSOC && len >= (int)sizeof(MsgDebugPsoc)) {
        const MsgDebugPsoc *msg = (const MsgDebugPsoc *)data;
        if (msg->node_id != NODE_ID) return;
        psoc.debugRamp(msg->enable != 0);
        sendCfgAck(CMD_DEBUG_PSOC, 1);
        SLAVE_LOG_PRINTF("[SLAVE] DEBUG_PSOC=%u\n", msg->enable);
        LOGM("DBGPSOC", "en=%u", msg->enable);
    }
    else if (cmd == CMD_SET_RECLEN && len >= (int)sizeof(MsgSetRecLen)) {
        const MsgSetRecLen *msg = (const MsgSetRecLen *)data;
        allocStore(msg->n_batches);
        /* Confirmar al maestro que el buffer está listo */
        MsgCfgAck ack = { CMD_CFG_ACK, NODE_ID, CMD_SET_RECLEN,
                          (uint8_t)((msg->n_batches == 0 || storeReadyForHotWait()) ? 1 : 0) };
        espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
    }
    else if (cmd == CMD_REQ_BATCH && len >= (int)sizeof(MsgReqBatch)) {
        handleReqBatch((const MsgReqBatch *)data);
    }
}

/* ── Store-and-forward helpers ───────────────────────────────────────────── */

static void allocStore(uint16_t n_batches)
{
    free(g_store_buf);  free(g_store_ts_us);
    g_store_buf    = nullptr;
    g_store_ts_us  = nullptr;
    g_store_fill   = 0;
    g_rec_n_batches= n_batches;
    if (n_batches == 0) return;
    g_store_buf   = (SampleBytes *)malloc((size_t)n_batches * SPI_BATCH_SAMPLES * sizeof(SampleBytes));
    g_store_ts_us = (uint32_t    *)malloc((size_t)n_batches * sizeof(uint32_t));
    if (!g_store_buf || !g_store_ts_us) {
        free(g_store_buf);
        free(g_store_ts_us);
        g_store_buf = nullptr;
        g_store_ts_us = nullptr;
    }
    SLAVE_LOG_PRINTF("[SLAVE] store alloc n=%u buf=%s\n",
                     n_batches, storeReadyForHotWait() ? "OK" : "FAIL");
}

static void handleReqBatch(const MsgReqBatch *msg)
{
    if (msg->node_id != NODE_ID) return;
    uint16_t seq = msg->batch_seq;
    if (g_state == SAMPLING) {
        return;   /* No TX ESP-NOW mientras el ADC está capturando. */
    }
    if (g_view_armPending ||
        (g_view_store_active && g_store_fill < g_rec_n_batches)) {
        SLAVE_LOG_PRINTF("[SLAVE] REQ_BATCH ignored during capture seq=%u fill=%u/%u state=%d\n",
                         seq, g_store_fill, g_rec_n_batches, (int)g_state);
        return;
    }
    if (seq >= g_store_fill || !g_store_buf) {
        /* Batch fuera de rango: notificar al master para que avance sin esperar timeout */
        MsgCfgAck nack = { CMD_CFG_ACK, NODE_ID, CMD_REQ_BATCH, 0 };
        espnowSend(MASTER_MAC, (const uint8_t *)&nack, sizeof(nack));
        SLAVE_LOG_PRINTF("[SLAVE] REQ_BATCH NACK seq=%u fill=%u\n", seq, g_store_fill);
        return;
    }
    const SampleBytes *s  = &g_store_buf[(size_t)seq * SPI_BATCH_SAMPLES];
    uint64_t           ts = g_t_start_us + (uint64_t)g_store_ts_us[seq];
    transport.sendStoredBatch(s, seq, ts, NODE_ID);
}

