simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
    /* Volver a esperar ARM después de STOP.
     * En modo store-and-forward (g_rec_n_batches > 0) permanecemos en STOPPED
     * respondiendo CMD_REQ_BATCH hasta que el maestro haya pedido todos los batches.
     * El maestro no envía ningún mensaje de "fin" — el slave sencillamente vuelve
     * a WAIT_ARM cuando recibe un CMD_ARM nuevo. */
    if (g_state == STOPPED && g_rec_n_batches == 0) {
        g_state = WAIT_ARM;
        SLAVE_LOG_PRINTF("[SLAVE %d] volviendo a WAIT_ARM\n", NODE_ID);
    }

    /* Reintento no-bloqueante de detección del PSoC — cada 2 s, fuera de captura activa */
    static uint32_t lastProbeMs = 0;
    if (!g_psocConnected && g_state != SAMPLING && g_state != HOT_WAIT &&
        g_view_remaining == 0 && (millis() - lastProbeMs) >= 2000) {
        lastProbeMs = millis();
        g_psocConnected = psoc.probe(300);
        if (g_psocConnected) {
            SLAVE_LOG_PRINTF("[SLAVE %d] PSoC: DETECTADO\n", NODE_ID);
            LOGM("PSOC", "detected=1");
        }
    }

    /* HELLO beacon cada 2 s en WAIT_ARM — diagnóstico de ESP-NOW bidireccional */
    static uint32_t lastHelloMs = 0;
    if (g_state == WAIT_ARM && millis() - lastHelloMs >= 2000) {
        lastHelloMs = millis();
        MsgHello h = { CMD_HELLO, NODE_ID, (uint8_t)g_psocConnected };
        esp_err_t err = espnowSend(MASTER_MAC, (const uint8_t *)&h, sizeof(h));
        SLAVE_LOG_PRINTF("[SLAVE] HELLO tx err=%d txOK=%u txFail=%u\n",
                         (int)err, transport.sentOK(), transport.sentFail());
    }

    /* Informe de estado cada 10 s */
    static uint32_t last_status = 0;
    if (g_state != HOT_WAIT && g_state != SAMPLING && !g_view_armPending &&
        millis() - last_status > 10000) {
        last_status = millis();
        MsgStatus st = {
            CMD_STATUS, NODE_ID,
            psoc.batchesOK(), psoc.batchesBad(),
            transport.sentOK(), transport.sentFail(),
            (uint8_t)g_psocConnected
        };
        espnowSend(MASTER_MAC, (const uint8_t *)&st, sizeof(st));
        logPsocUartDiag("STATUS");
    }
}
